-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\My Drive\Research\Proesa - 22-1002-PahoElasSsb\Code\Model\Tobacconomics\bstrapDemand.log
  log type:  text
 opened on:   9 Apr 2023, 17:32:43

. drop _all

. vecmx xep vxep

. set obs 1
Number of observations (_N) was 0, now 1.

. gen reps=0

. global nels=$ng1*$ng1

. global nmc=100 // the simulation is repeated 1000 times

. cap program drop vtodat

. program define vtodat
  1. local ic=1
  2. while `ic' <= $nels {
  3. gen e`ic'=vxep[`ic',1]
  4. local ic=`ic'+1
  5. }
  6. end

. vtodat

. save bootstrap.dta, replace
file bootstrap.dta saved

. drop _all

. 
. **** Ojo dummies de region
. /*
> *This should be used only if the region dummies in allindia.do were used
> cap program drop purge
> program define purge
> local ig=1
> while `ig' <= $ngds {
> qui regress y0c`ig' regiond*
> 
> predict tm, resid
> replace y0c`ig'=tm
> drop tm
> qui regress y1c`ig' regiond*
> predict tm, resid
> replace y1c`ig'=tm
> drop tm
> local ig=`ig'+1
> }
> end
> */
. 
. cap program drop mkns

. program define mkns
  1. local ig=1
  2. while `ig' <= $ngds {
  3. replace n0c`ig'=1/n0c`ig'
  4. replace n1c`ig'=1/n1c`ig'
  5. qui summ n0c`ig'
  6. matrix n0[`ig',1]=(_result(3))^(-1)
  7. qui summ n1c`ig'
  8. matrix n1[`ig',1]=(_result(3))^(-1)
  9. drop n0c`ig' n1c`ig'
 10. local ig=`ig'+1
 11. }
 12. end

. 
. cap program drop mkcov

. program def mkcov
  1. local ir=1
  2. while `ir' <= $ngds {
  3. local ic=1
  4. while `ic' <= $ngds {
  5. qui corr y1c`ir' y1c`ic', cov
  6. matrix s[`ir',`ic']=_result(4)
  7. qui corr y1c`ir' y0c`ic', cov
  8. matrix r[`ir',`ic']=_result(4)
  9. local ic=`ic'+1
 10. }
 11. local ir=`ir'+1
 12. }
 13. end

. 
. cap program drop fixmat

. program def fixmat
  1. matrix def sf=s
  2. matrix def rf=r
  3. local ig=1
  4. while `ig' <= $ngds {
  5.         matrix sf[`ig',`ig']=sf[`ig',`ig']-ome[`ig',1]/n1[`ig',1]
  6. matrix rf[`ig',`ig']=rf[`ig',`ig']-lam[`ig',1]/n0[`ig',1]
  7. local ig=`ig'+1
  8. }
  9. end

. 
. cap program drop mkels

. program define mkels
  1. matrix cmx=bhat'
  2. matrix cmx=dxi*cmx
  3. matrix cmx1=dxi*dwbar
  4. matrix cmx=iden-cmx
  5. matrix cmx=cmx+cmx1
  6. matrix psi=inv(cmx)
  7. matrix theta=bhat'*psi
  8. display("Theta matrix")
  9. matrix list theta
 10. matrix ep=bhat'
 11. matrix ep=idwbar*ep
 12. matrix ep=ep-iden
 13. matrix ep=ep*psi
 14. end

. 
. cap program drop complet

. program define complet
  1. *First extending theta
. matrix atm=theta*itm
  2. matrix atm=-1*atm
  3. matrix atm=atm-b0
  4. matrix xtheta=theta,atm
  5. matrix atm=xtheta'
  6. matrix atm=atm*itm
  7. matrix atm=atm'
  8. matrix xtheta=xtheta\atm
  9. *Extending the diagonal matrices
. matrix wlast=wbar'*itm
 10. matrix won=(1)
 11. matrix wlast=won-wlast
 12. matrix xwbar=wbar\wlast
 13. matrix dxwbar=diag(xwbar)
 14. matrix idxwbar=syminv(dxwbar)
 15. matrix b1last=(0.25)
 16. matrix xb1=b1\b1last
 17. matrix b0last=b0'*itm
 18. matrix b0last=-1*b0last
 19. matrix xb0=b0\b0last
 20. matrix xe=itm1-xb1
 21. matrix tm=idxwbar*xb0
 22. matrix xe=xe+tm
 23. 
. matrix tm=xe'
 24. matrix xxi=itm1-xb1
 25. matrix xxi=dxwbar*xxi
 26. matrix xxi=xxi+xb0
 27. matrix tm=diag(xb1)
 28. matrix tm=syminv(tm)
 29. matrix xxi=tm*xxi
 30. matrix dxxi=diag(xxi)
 31. *Extending psi
. matrix xpsi=dxxi*xtheta
 32. matrix xpsi=xpsi+iden1
 33. matrix atm=dxxi*dxwbar
 34. matrix atm=atm+iden1
 35. matrix atm=syminv(atm)
 36. matrix xpsi=atm*xpsi
 37. matrix ixpsi=inv(xpsi)
 38. *Extending bhat & elasticity matrix
. matrix xbhatp=xtheta*ixpsi
 39. matrix xep=idxwbar*xbhatp
 40. matrix xep=xep-iden1
 41. matrix xep=xep*xpsi
 42. end

. 
. cap program drop bootindi

. program define bootindi
  1. local expno=1
  2. while `expno' <= $nmc {
  3. display("Simulation Number `expno'")
  4. quietly {
  5. use tempclus.dta
  6. bsample _N
  7. /*
> qui tab region, gen(regiond)
> *qui tab subrnd, gen(quard)
> purge
> drop regiond*
> */
. matrix define n0=J($ngds,1,0)
  8. matrix define n1=J($ngds,1,0)
  9. *Averaging (harmonically) numbers of obs over clusters
. mkns
 10. *Making the intercluster variance and covariance matrices
. *This is done in pairs because of the missing values
. matrix s=J($ngds,$ngds,0)
 11. matrix r=J($ngds,$ngds,0)
 12. 
. mkcov
 13. *We don't need the data any more
. drop _all
 14. *Making OLS estimates
. matrix bols=syminv(s)
 15. matrix bols=bols*r
 16. *Corrections for measurement error
. fixmat
 17. matrix invs=syminv(sf)
 18. matrix bhat=invs*rf
 19. global ng1=$ngds+1
 20. matrix iden=I($ngds)
 21. matrix iden1=I($ng1)
 22. matrix itm=J($ngds,1,1)
 23. matrix itm1=J($ng1,1,1)
 24. matrix dxi=diag(xi)
 25. matrix dwbar=diag(wbar)
 26. matrix idwbar=syminv(dwbar)
 27. mkels
 28. **Completing the system by filling out the matrices
. ** Gives standard errors for elasticities without symmetry restrictions
. complet //Drop this command if the intend is to estimate symmetry constrained standard errors
 29. *If it is only the unconstrainted estimates that we are intereted in there is
. *no need to run the code from this point till the next command complet
. **Calculating symmetry restricted estimators
. vecmx bhat vbhat
 30. ** R matrix for restrictions
. lmx $ngds llx
 31. commx $ngds k
 32. global ng2=$ngds*$ngds
 33. matrix bigi=I($ng2)
 34. matrix k=bigi-k
 35. matrix r=llx*k
 36. matrix drop k
 37. matrix drop bigi
 38. matrix drop llx
 39. ** r vector for restrictions, called rh
. matrix rh=b0#wbar
 40. matrix rh=r*rh
 41. matrix rh=-1*rh
 42. **doing the constrained estimation
. matrix iss=iden#invs
 43. matrix rp=r'
 44. matrix iss=iss*rp
 45. matrix inn=r*iss
 46. matrix inn=syminv(inn)
 47. matrix inn=iss*inn
 48. 
. matrix dis=r*vbhat
 49. matrix dis=rh-dis
 50. matrix dis=inn*dis
 51. matrix vbtild=vbhat+dis
 52. unvecmx vbtild btild
 53. **going back to get elasticities and complete sytem
. matrix bhat=btild
 54. mkels
 55. ** Gives standard errors for elasticity with symmetry restrictions
. complet
 56. vecmx xep vxep
 57. set obs 1
 58. gen reps=`expno'
 59. vtodat
 60. append using bootstrap.dta
 61. save bootstrap.dta, replace
 62. drop _all
 63. local expno=`expno'+1
 64. }
 65. sleep 900
 66. }
 67. end

. bootindi
Simulation Number 1
Simulation Number 2
Simulation Number 3
Simulation Number 4
Simulation Number 5
Simulation Number 6
Simulation Number 7
Simulation Number 8
Simulation Number 9
Simulation Number 10
Simulation Number 11
Simulation Number 12
Simulation Number 13
Simulation Number 14
Simulation Number 15
Simulation Number 16
Simulation Number 17
Simulation Number 18
Simulation Number 19
Simulation Number 20
Simulation Number 21
Simulation Number 22
Simulation Number 23
Simulation Number 24
Simulation Number 25
Simulation Number 26
Simulation Number 27
Simulation Number 28
Simulation Number 29
Simulation Number 30
Simulation Number 31
Simulation Number 32
Simulation Number 33
Simulation Number 34
Simulation Number 35
Simulation Number 36
Simulation Number 37
Simulation Number 38
Simulation Number 39
Simulation Number 40
Simulation Number 41
Simulation Number 42
Simulation Number 43
Simulation Number 44
Simulation Number 45
Simulation Number 46
Simulation Number 47
Simulation Number 48
Simulation Number 49
Simulation Number 50
Simulation Number 51
Simulation Number 52
Simulation Number 53
Simulation Number 54
Simulation Number 55
Simulation Number 56
Simulation Number 57
Simulation Number 58
Simulation Number 59
Simulation Number 60
Simulation Number 61
Simulation Number 62
Simulation Number 63
Simulation Number 64
Simulation Number 65
Simulation Number 66
Simulation Number 67
Simulation Number 68
Simulation Number 69
Simulation Number 70
Simulation Number 71
Simulation Number 72
Simulation Number 73
Simulation Number 74
Simulation Number 75
Simulation Number 76
Simulation Number 77
Simulation Number 78
Simulation Number 79
Simulation Number 80
Simulation Number 81
Simulation Number 82
Simulation Number 83
Simulation Number 84
Simulation Number 85
Simulation Number 86
Simulation Number 87
Simulation Number 88
Simulation Number 89
Simulation Number 90
Simulation Number 91
Simulation Number 92
Simulation Number 93
Simulation Number 94
Simulation Number 95
Simulation Number 96
Simulation Number 97
Simulation Number 98
Simulation Number 99
Simulation Number 100

. use bootstrap.dta

. display("Monte Carlo results")
Monte Carlo results

. summ

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        reps |        101          50    29.30017          0        100
          e1 |        101    -.335468    .0706469  -.4832188  -.1993282
          e2 |        101    .6831954    .9671293  -1.481843   2.945777
          e3 |        101    .6005495    .4588771   -.190511   2.291142
          e4 |        101    .0649825    .1976127  -.3173292   .5782475
-------------+---------------------------------------------------------
          e5 |        101   -.0080304    .0079073   -.026506   .0097899
          e6 |        101    1.63e-10    6.99e-11   4.54e-11   3.63e-10
          e7 |        101    .0296773     .039699   -.061516   .1217489
          e8 |        101   -.3181133    .5290932  -1.375472   1.331615
          e9 |        101   -.4265547    .2074134  -1.086687  -.0618474
-------------+---------------------------------------------------------
         e10 |        101   -.3189835    .0775874   -.538647  -.1592308
         e11 |        101   -.0000913    .0053516  -.0117998   .0221135
         e12 |        101   -4.07e-11    2.47e-11  -1.46e-10  -2.06e-12
         e13 |        101    .0934009    .0590017  -.0037652   .3105785
         e14 |        101   -1.307808    .6403629  -3.343932  -.1809678
-------------+---------------------------------------------------------
         e15 |        101   -.2556827    .4736353  -1.115172   1.432068
         e16 |        101     .177879    .1543107  -.0647685   .8381116
         e17 |        101   -.0166321    .0088716  -.0461543    .000845
         e18 |        101    4.16e-11    5.22e-11  -6.27e-11   2.35e-10
         e19 |        101     .012614    .0272079  -.0408586    .084571
-------------+---------------------------------------------------------
         e20 |        101   -1.074712    .2567776  -1.799597  -.5431284
         e21 |        101    .1661223    .1650052  -.0935263   .8715347
         e22 |        101   -1.456044    .1008193  -1.719456  -1.141178
         e23 |        101     .010179    .0043257  -.0022033   .0215075
         e24 |        101   -4.96e-12    1.89e-11  -4.28e-11   8.11e-11
-------------+---------------------------------------------------------
         e25 |        101   -.0750108    .0606322  -.2244686   .0563407
         e26 |        101   -.1167248    .9601405  -2.216871   3.905383
         e27 |        101   -1.253633    .5298868  -3.049473  -.2207964
         e28 |        101    .4482704    .2367702  -.2455781   1.063409
         e29 |        101    -.141066    .0114702  -.1718981  -.1081628
-------------+---------------------------------------------------------
         e30 |        101   -1.41e-10    8.03e-11  -4.31e-10   4.75e-11
         e31 |        101   -.1827137    .0774157  -.3812824  -.0364964
         e32 |        101    .8552582    .6559221  -.2618222   3.627141
         e33 |        101   -.2316391     .418745  -1.674989   .5784318
         e34 |        101    .0556866    .1395711  -.5567488   .3370677
-------------+---------------------------------------------------------
         e35 |        101    .0210302    .0122581  -.0119248   .0658609
         e36 |        101          -1           0         -1         -1

. summ,d

                            reps
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              0
 5%            5              1
10%           10              2       Obs                 101
25%           25              3       Sum of wgt.         101

50%           50                      Mean                 50
                        Largest       Std. dev.      29.30017
75%           75             97
90%           90             98       Variance          858.5
95%           95             99       Skewness              0
99%           99            100       Kurtosis       1.799765

                             e1
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.4732267      -.4832188
 5%    -.4456927      -.4732267
10%    -.4227943      -.4715534       Obs                 101
25%    -.3943397      -.4651651       Sum of wgt.         101

50%    -.3308617                      Mean           -.335468
                        Largest       Std. dev.      .0706469
75%    -.2763857      -.2212797
90%    -.2457096      -.2204806       Variance        .004991
95%    -.2344483      -.2194357       Skewness      -.0725936
99%    -.2194357      -.1993282       Kurtosis       1.968788

                             e2
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.184518      -1.481843
 5%    -.8015816      -1.184518
10%    -.3949173      -1.096517       Obs                 101
25%     .0447083      -1.018487       Sum of wgt.         101

50%     .6004373                      Mean           .6831954
                        Largest       Std. dev.      .9671293
75%     1.346473       2.669567
90%      1.94664       2.818629       Variance        .935339
95%     2.445687       2.866299       Skewness       .2598782
99%     2.866299       2.945777       Kurtosis       2.648755

                             e3
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1598187       -.190511
 5%    -.0285986      -.1598187
10%      .069105      -.0995852       Obs                 101
25%     .3152434      -.0920238       Sum of wgt.         101

50%     .5173967                      Mean           .6005495
                        Largest       Std. dev.      .4588771
75%     .8025674       1.571788
90%     1.166119       1.650355       Variance       .2105682
95%     1.457614       2.032161       Skewness       .9847521
99%     2.032161       2.291142       Kurtosis       4.482088

                             e4
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2671486      -.3173292
 5%    -.1985149      -.2671486
10%    -.1650953      -.2185176       Obs                 101
25%    -.0688715      -.2100309       Sum of wgt.         101

50%     .0245857                      Mean           .0649825
                        Largest       Std. dev.      .1976127
75%     .1675711       .4553821
90%     .3762372       .5270898       Variance       .0390508
95%     .4374465       .5338452       Skewness       .6095417
99%     .5338452       .5782475       Kurtosis       2.755222

                             e5
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0260879       -.026506
 5%    -.0205347      -.0260879
10%     -.017096      -.0259467       Obs                 101
25%    -.0131927      -.0251739       Sum of wgt.         101

50%     -.008951                      Mean          -.0080304
                        Largest       Std. dev.      .0079073
75%     -.002668       .0057672
90%     .0030941        .007317       Variance       .0000625
95%     .0042838       .0094208       Skewness      -.0039768
99%     .0094208       .0097899       Kurtosis       2.768104

                             e6
-------------------------------------------------------------
      Percentiles      Smallest
 1%     4.78e-11       4.54e-11
 5%     7.07e-11       4.78e-11
10%     8.57e-11       5.19e-11       Obs                 101
25%     1.09e-10       5.77e-11       Sum of wgt.         101

50%     1.54e-10                      Mean           1.63e-10
                        Largest       Std. dev.      6.99e-11
75%     2.05e-10       3.13e-10
90%     2.44e-10       3.43e-10       Variance       4.88e-21
95%     3.02e-10       3.48e-10       Skewness       .6815986
99%     3.48e-10       3.63e-10       Kurtosis       3.171867

                             e7
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0481042       -.061516
 5%    -.0314336      -.0481042
10%    -.0149396      -.0427785       Obs                 101
25%     .0043356      -.0394995       Sum of wgt.         101

50%     .0268591                      Mean           .0296773
                        Largest       Std. dev.       .039699
75%     .0574247       .1110367
90%     .0808103        .116723       Variance        .001576
95%     .1020766        .119566       Skewness       .2319401
99%      .119566       .1217489       Kurtosis       2.658314

                             e8
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1.29116      -1.375472
 5%    -1.189726       -1.29116
10%     -.976048      -1.262028       Obs                 101
25%    -.7083458      -1.242592       Sum of wgt.         101

50%    -.3769902                      Mean          -.3181133
                        Largest       Std. dev.      .5290932
75%     .0375616       .7575185
90%      .308762       .7816097       Variance       .2799396
95%      .607574        .913519       Skewness       .3710752
99%      .913519       1.331615       Kurtosis       3.089055

                             e9
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.9749582      -1.086687
 5%    -.8781515      -.9749582
10%    -.7295732      -.9729359       Obs                 101
25%    -.5158316       -.954143       Sum of wgt.         101

50%    -.3971247                      Mean          -.4265547
                        Largest       Std. dev.      .2074134
75%    -.2722794      -.1322195
90%    -.2109373      -.1321529       Variance       .0430203
95%    -.1740607      -.0793575       Skewness      -1.021059
99%    -.0793575      -.0618474       Kurtosis       3.965506

                             e10
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.5235711       -.538647
 5%    -.4533824      -.5235711
10%    -.4196491      -.5104678       Obs                 101
25%    -.3626478      -.4840272       Sum of wgt.         101

50%    -.3141733                      Mean          -.3189835
                        Largest       Std. dev.      .0775874
75%      -.26572      -.1830917
90%    -.2240252      -.1754378       Variance       .0060198
95%    -.1895927      -.1719673       Skewness       -.373542
99%    -.1719673      -.1592308       Kurtosis       3.258036

                             e11
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -.011545      -.0117998
 5%    -.0070253       -.011545
10%    -.0055786      -.0110884       Obs                 101
25%     -.003887      -.0078909       Sum of wgt.         101

50%    -.0002632                      Mean          -.0000913
                        Largest       Std. dev.      .0053516
75%     .0030529       .0117535
90%      .005992       .0128207       Variance       .0000286
95%     .0074647       .0136889       Skewness       .8143994
99%     .0136889       .0221135       Kurtosis       5.234289

                             e12
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.07e-10      -1.46e-10
 5%    -7.38e-11      -1.07e-10
10%    -6.82e-11      -1.06e-10       Obs                 101
25%    -5.30e-11      -9.83e-11       Sum of wgt.         101

50%    -3.97e-11                      Mean          -4.07e-11
                        Largest       Std. dev.      2.47e-11
75%    -2.32e-11      -3.42e-12
90%    -1.16e-11      -3.07e-12       Variance       6.10e-22
95%    -8.45e-12      -2.69e-12       Skewness      -1.127915
99%    -2.69e-12      -2.06e-12       Kurtosis       5.529485

                             e13
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -.002856      -.0037652
 5%     .0122977       -.002856
10%     .0254121       .0037866       Obs                 101
25%     .0571327        .006692       Sum of wgt.         101

50%     .0820074                      Mean           .0934009
                        Largest       Std. dev.      .0590017
75%     .1195007       .2158012
90%     .1692936       .2333509       Variance       .0034812
95%     .2066374       .2774816       Skewness       1.015302
99%     .2774816       .3105785       Kurtosis       4.498133

                             e14
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -3.001133      -3.343932
 5%    -2.703725      -3.001133
10%    -2.242765      -2.998064       Obs                 101
25%    -1.582506      -2.936419       Sum of wgt.         101

50%     -1.21695                      Mean          -1.307808
                        Largest       Std. dev.      .6403629
75%    -.8300345        -.39904
90%     -.641324      -.3956236       Variance       .4100647
95%    -.5273758      -.2357555       Skewness      -1.019621
99%    -.2357555      -.1809678       Kurtosis       3.964473

                             e15
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.8647099      -1.115172
 5%    -.7797642      -.8647099
10%     -.725202      -.8261366       Obs                 101
25%    -.5656441      -.8101982       Sum of wgt.         101

50%     -.387387                      Mean          -.2556827
                        Largest       Std. dev.      .4736353
75%     -.038797       .9194173
90%     .4132227       .9312503       Variance       .2243304
95%     .6221983       1.021742       Skewness       1.173986
99%     1.021742       1.432068       Kurtosis       4.151784

                             e16
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0517529      -.0647685
 5%    -.0161217      -.0517529
10%     .0027707      -.0327906       Obs                 101
25%     .0587432      -.0218572       Sum of wgt.         101

50%     .1573554                      Mean            .177879
                        Largest       Std. dev.      .1543107
75%     .2525771       .4746473
90%     .3549782       .5012801       Variance       .0238118
95%     .4542065       .7561511       Skewness       1.433289
99%     .7561511       .8381116       Kurtosis       6.596198

                             e17
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0460055      -.0461543
 5%    -.0337882      -.0460055
10%    -.0282376      -.0362374       Obs                 101
25%    -.0212171      -.0359265       Sum of wgt.         101

50%    -.0152588                      Mean          -.0166321
                        Largest       Std. dev.      .0088716
75%    -.0099675      -.0039011
90%    -.0080154      -.0028835       Variance       .0000787
95%    -.0065879      -.0021465       Skewness      -1.016221
99%    -.0021465        .000845       Kurtosis       4.201839

                             e18
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -4.54e-11      -6.27e-11
 5%    -1.91e-11      -4.54e-11
10%    -1.28e-11      -4.10e-11       Obs                 101
25%     7.46e-12      -3.35e-11       Sum of wgt.         101

50%     3.24e-11                      Mean           4.16e-11
                        Largest       Std. dev.      5.22e-11
75%     7.17e-11       1.61e-10
90%     1.00e-10       1.79e-10       Variance       2.72e-21
95%     1.23e-10       2.10e-10       Skewness       1.081345
99%     2.10e-10       2.35e-10       Kurtosis       4.793171

                             e19
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0332116      -.0408586
 5%    -.0235845      -.0332116
10%     -.019538      -.0261086       Obs                 101
25%    -.0062834      -.0251917       Sum of wgt.         101

50%     .0067498                      Mean            .012614
                        Largest       Std. dev.      .0272079
75%     .0270557       .0659305
90%     .0543042       .0758953       Variance       .0007403
95%     .0646472       .0769149       Skewness       .6161694
99%     .0769149        .084571       Kurtosis       2.791516

                             e20
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.750753      -1.799597
 5%    -1.521214      -1.750753
10%    -1.406497      -1.707473       Obs                 101
25%    -1.218159      -1.617333       Sum of wgt.         101

50%    -1.059266                      Mean          -1.074712
                        Largest       Std. dev.      .2567776
75%    -.8951743      -.6264298
90%    -.7599728      -.5961975       Variance       .0659347
95%    -.6470373      -.5869724       Skewness      -.3595168
99%    -.5869724      -.5431284       Kurtosis       3.246638

                             e21
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0809032      -.0935263
 5%    -.0417031      -.0809032
10%    -.0205369      -.0597983       Obs                 101
25%     .0379367      -.0482056       Sum of wgt.         101

50%     .1448975                      Mean           .1661223
                        Largest       Std. dev.      .1650052
75%     .2459789       .4822875
90%     .3549371       .5096341       Variance       .0272267
95%     .4606469       .7896817       Skewness       1.437813
99%     .7896817       .8715347       Kurtosis       6.642116

                             e22
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1.68781      -1.719456
 5%    -1.586593       -1.68781
10%     -1.56532       -1.64782       Obs                 101
25%    -1.526486      -1.601813       Sum of wgt.         101

50%    -1.457655                      Mean          -1.456044
                        Largest       Std. dev.      .1008193
75%    -1.394592       -1.26338
90%    -1.332983      -1.204302       Variance       .0101645
95%      -1.2903      -1.187417       Skewness       .4312316
99%    -1.187417      -1.141178       Kurtosis       3.696059

                             e23
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0013194      -.0022033
 5%     .0020098      -.0013194
10%     .0037828      -.0003204       Obs                 101
25%     .0081857       .0010536       Sum of wgt.         101

50%     .0106569                      Mean            .010179
                        Largest       Std. dev.      .0043257
75%     .0129292       .0164826
90%     .0147433       .0197534       Variance       .0000187
95%     .0157035       .0198063       Skewness      -.4658849
99%     .0198063       .0215075       Kurtosis        3.69759

                             e24
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -4.09e-11      -4.28e-11
 5%    -2.91e-11      -4.09e-11
10%    -2.52e-11      -3.82e-11       Obs                 101
25%    -1.61e-11      -3.59e-11       Sum of wgt.         101

50%    -6.80e-12                      Mean          -4.96e-12
                        Largest       Std. dev.      1.89e-11
75%     4.66e-12       2.34e-11
90%     1.63e-11       2.57e-11       Variance       3.58e-22
95%     2.08e-11       6.90e-11       Skewness       1.358409
99%     6.90e-11       8.11e-11       Kurtosis       7.794749

                             e25
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -.224236      -.2244686
 5%    -.1689018       -.224236
10%    -.1489671      -.2176397       Obs                 101
25%    -.1103307      -.2069262       Sum of wgt.         101

50%    -.0793221                      Mean          -.0750108
                        Largest       Std. dev.      .0606322
75%    -.0327942       .0285147
90%       .00545       .0382342       Variance       .0036763
95%     .0205168       .0547771       Skewness      -.1364779
99%     .0547771       .0563407       Kurtosis       2.896209

                             e26
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.121187      -2.216871
 5%    -1.321189      -2.121187
10%    -1.095027      -2.062751       Obs                 101
25%    -.7858929      -1.517277       Sum of wgt.         101

50%    -.1793709                      Mean          -.1167248
                        Largest       Std. dev.      .9601405
75%     .4252391       2.017923
90%     .9588867       2.265138       Variance       .9218698
95%     1.203772       2.391598       Skewness       .8703347
99%     2.391598       3.905383       Kurtosis       5.382386

                             e27
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -3.003777      -3.049473
 5%    -2.280464      -3.003777
10%    -1.959152      -2.434141       Obs                 101
25%    -1.502742      -2.428273       Sum of wgt.         101

50%    -1.161036                      Mean          -1.253633
                        Largest       Std. dev.      .5298868
75%    -.8613937      -.5087664
90%    -.7490462      -.4541866       Variance       .2807801
95%    -.6604912      -.3999761       Skewness      -1.050995
99%    -.3999761      -.2207964       Kurtosis       4.284765

                             e28
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2109129      -.2455781
 5%     .0158835      -.2109129
10%     .1229513      -.1157931       Obs                 101
25%     .3319935      -.0613681       Sum of wgt.         101

50%     .4741125                      Mean           .4482704
                        Largest       Std. dev.      .2367702
75%      .597204       .7891196
90%     .7052426       .9623938       Variance       .0560601
95%     .7465816       .9699311       Skewness      -.5069256
99%     .9699311       1.063409       Kurtosis       3.769437

                             e29
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1665258      -.1718981
 5%    -.1567955      -.1665258
10%    -.1555808      -.1659315       Obs                 101
25%    -.1479431      -.1596301       Sum of wgt.         101

50%    -.1417932                      Mean           -.141066
                        Largest       Std. dev.      .0114702
75%    -.1339627      -.1185624
90%     -.127727      -.1183379       Variance       .0001316
95%    -.1197966      -.1181643       Skewness       .0985786
99%    -.1181643      -.1081628       Kurtosis       3.197331

                             e30
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -4.26e-10      -4.31e-10
 5%    -2.48e-10      -4.26e-10
10%    -2.42e-10      -2.70e-10       Obs                 101
25%    -1.84e-10      -2.60e-10       Sum of wgt.         101

50%    -1.34e-10                      Mean          -1.41e-10
                        Largest       Std. dev.      8.03e-11
75%    -9.13e-11      -2.19e-12
90%    -4.87e-11      -3.63e-13       Variance       6.45e-21
95%    -1.01e-11       6.85e-12       Skewness      -.6550126
99%     6.85e-12       4.75e-11       Kurtosis       4.784872

                             e31
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.3792154      -.3812824
 5%     -.345286      -.3792154
10%    -.2784045      -.3642471       Obs                 101
25%    -.2271606      -.3517996       Sum of wgt.         101

50%    -.1730673                      Mean          -.1827137
                        Largest       Std. dev.      .0774157
75%    -.1211264      -.0490059
90%    -.1013176      -.0488378       Variance       .0059932
95%    -.0765481       -.041726       Skewness      -.5451745
99%     -.041726      -.0364964       Kurtosis       2.950738

                             e32
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2569864      -.2618222
 5%    -.0533119      -.2569864
10%     .0801124      -.2301576       Obs                 101
25%     .4161851      -.1593085       Sum of wgt.         101

50%     .8433877                      Mean           .8552582
                        Largest       Std. dev.      .6559221
75%     1.171452       2.241714
90%     1.637093       2.449012       Variance       .4302338
95%     1.802927       2.619327       Skewness       .9834366
99%     2.619327       3.627141       Kurtosis       5.291103

                             e33
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.589558      -1.674989
 5%    -.8836182      -1.589558
10%    -.7084599      -1.417627       Obs                 101
25%    -.4647911      -1.212894       Sum of wgt.         101

50%    -.1518302                      Mean          -.2316391
                        Largest       Std. dev.       .418745
75%     .0237687       .4150244
90%     .2108992        .479676       Variance       .1753474
95%     .3055186       .5661418       Skewness      -.9563352
99%     .5661418       .5784318       Kurtosis       4.572073

                             e34
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.4653837      -.5567488
 5%    -.1587144      -.4653837
10%    -.0801766      -.1826103       Obs                 101
25%    -.0308764      -.1617527       Sum of wgt.         101

50%     .0772323                      Mean           .0556866
                        Largest       Std. dev.      .1395711
75%     .1494429       .2818321
90%     .2081872       .3108952       Variance       .0194801
95%     .2391916       .3351947       Skewness      -1.184447
99%     .3351947       .3370677       Kurtosis       6.920873

                             e35
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0023906      -.0119248
 5%     .0004054      -.0023906
10%     .0069674      -.0011577       Obs                 101
25%     .0131602      -.0011418       Sum of wgt.         101

50%     .0211401                      Mean           .0210302
                        Largest       Std. dev.      .0122581
75%     .0281036       .0390119
90%     .0352684        .040081       Variance       .0001503
95%     .0376315       .0605995       Skewness       .4143838
99%     .0605995       .0658609       Kurtosis       4.669519

                             e36
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           -1             -1       Obs                 101
25%           -1             -1       Sum of wgt.         101

50%           -1                      Mean                 -1
                        Largest       Std. dev.             0
75%           -1             -1
90%           -1             -1       Variance              0
95%           -1             -1       Skewness              .
99%           -1             -1       Kurtosis              .

. log close
      name:  <unnamed>
       log:  H:\My Drive\Research\Proesa - 22-1002-PahoElasSsb\Code\Model\Tobacconomics\bstrapDemand.log
  log type:  text
 closed on:   9 Apr 2023, 17:34:19
-----------------------------------------------------------------------------------------------------------------------------------
